/* 
Завдання 1: Математичні оператори

1) Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
2) Обчисліть площу і периметр прямокутника.
3) Виведіть площу і периметр.
4) Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
*/


void main() {
  double width = 18.4;
  double height = 30.9;

  var area = width * height;
  var perimeter = (width + height) * 2;

  print("Площа прямокутника $area см2, a його периметр $perimeter см");

  var tiles = area ~/ 1;

  print("В цю площу вміщається $tiles квадратів 1х1 см");
}